from aiogram import types, Router
from aiogram.filters import Command

router = Router()


HELP_MESSAGE = """<b>Привет, всё просто! 👋</b>

📚 Сначала <b>добавь контент в библиотеку</b>, потом сможешь вернуться к нему позже:
/add — найти и добавить фильм или сериал в список. 
/delete — если перепутал!

🔍 Не знаешь, что добавить? <b>Просто напиши название</b> — я найду!

🍿 Готов посмотреть что-то из отложенного?
/list — открыть свой список ожидания.

✅ Уже посмотрел что-то?
/viewed — отметить фильм или сериал как просмотренный.

📅 Следишь за новыми сериями?
/dates — покажу даты выхода.

🤝 Хочешь поделиться подборкой?
/share — сгенерирую список для друга.
"""


@router.message(Command("help"))
async def send_welcome(message: types.Message):
    await message.answer(HELP_MESSAGE, parse_mode="HTML")
