# = = = = = = = = = = = REQUESTS & RESPONSES = = = = = = = = = = = = =

POSITIVE_REQUESTS = [
    "да",
    "lf",
    "ок",
    "го",
    "давай",
    "добавь",
    "добавляй",
    "ок",
    "ну",
    "yes",
    "sure",
    "конечно",
    "пожалуйста",
    "согласен",
    "принимаю",
    "вызывай",
    "делай",
    "ставь",
    "хорошо",
    "согласен добавить",
    "заводи",
    "поехали",
    "давай добавим",
    "да, добавляй",
    "да, конечно",
    "да, давай",
    "да давай",
    "буду рад",
    "включай",
    "окей",
    "отлично",
    "подходит",
    "начинай",
    "погнали",
    "да, круто",
    "да, добавим",
    "сделаем",
    "погнали добавлять",
    "подтверждаю",
    "окей, добавь",
    "загружай",
    "поддерживаю",
    "подходит",
    "давай, добавляй",
]

# /search
WHAT_YOU_WANNA_SEARCH_RESPONSES = [
    "Что ищем? Напиши название фильма или сериала",
    "Какое название?)",
    "Что ищем?)",
    "Напиши название, я найду!",
    "Что тебя интересует?)",
    "Что будем искать?",
    "Введи название, и я найду.",
    "Напомни мне название, пожалуйста.",
    "Что именно ты хочешь найти?",
    "Кидай название, я всё сделаю! 😎",
    "Щас как загуглю, какое название?",
    "Что будем смотреть?)",
    "Говори, что искать!)",
    "Напиши название, и я помогу.",
    "Давай начнём с названия.",
    "Какой фильм или сериал ищем?",
    "Говори, что искать!)",
    "Напиши название, и я помогу.",
    "Давай начнём с названия.",
]

# /add
WHAT_YOU_WANNA_ADD_RESPONSES = [
    "Оке, что добавить?",
    "Какое название?)",
    "Что ищем?)",
    "Что добавить в список?",
    "Какой фильм или сериал добавить?",
    "Напиши название, я найду!",
    "Добавляем? Напиши, что.",
    "Что тебя интересует?)",
    "Что будем искать?",
    "Введи название, и я найду.",
    "Какой контент добавить?)",
    "Напомни мне название, пожалуйста.",
    "Что именно ты хочешь найти?",
    "Кидай название, я всё сделаю! 😎",
    "Щас как загуглю, какое название?",
    "Что добавить? Жду!",
    "Что будем смотреть?)",
    "Какой фильм или сериал ищем?",
    "Расскажи, что добавить?",
    "Говори, что искать!)",
    "Напиши название, и я помогу.",
    "Давай начнём с названия.",
]

# /add [ ERROR ]: BOT_FOUND
CONTENT_NOT_FOUND_RESPONSES = [
    "Не нашёл... 😔",
    "Либо ты на китайском написал, либо такого нет... 🤔",
    "К сожалению, ничего не нашёл, попробуй уточнить название или добавить год выпуска. 😕",
    "Эх, не удалось найти... 😔",
    "Ничего не нашёл по твоему запросу. Попробуй уточнить название)",
    "Хм, такого у меня нет... Попробуй уточнить название?",
    "Не нашёл. Может, опечатка или очепятка? 🤔",
    "Что за фильм такой, неизвестный... 😢",
    "Увы, ничего не вышло. Может, попробуешь перефразировать?",
    "Ну я не нашёл 😅",
    "Говорят его выкрали вместе с режиссёром... Может поэтому не могу найти... 🙈",
    "Пока ничего не нашёл. Может как-то по другому называется?",
    "Я фиг знает чё это, не ищется, и вообще мне впадлу.",
    "Привет, на самом деле этот бот это я, Абульбар, я из Индии. Помоги мне пож...\n\nЛадно, шучу, не могу найти, попробуй перефразировать.",
]

# /add [ ERROR ]: ALREADY_IN_LIST
ALREADY_IN_LIST_RESPONSES = [
    "Он уже в вашем списке 😉",
    "Этот контент уже в вашем списке 😉",
    "Когда-то вы уже добавляли его в список.",
    "Вы уже добавили этот фильм! 😊",
    "Этот фильм уже есть в вашем списке к просмотру.",
    "Этот контент уже был добавлен раньше. 😅",
    "Этот фильм уже в списке, но мы можем добавить что-то новое!",
    "Вы уже добавляли его раньше. Как насчет другого фильма?",
]

# /delete
WHAT_YOU_WANNA_DELETE_RESPONSES = [
    "Какой фильм или сериал хочешь удалить?",
    "Назови, что удаляем!",
    "Что убираем? Напиши название.",
    "Какое название удалить?",
    "Говори, что удаляем!)",
    "Напиши название для удаления.",
    "Что будем убирать?",
    "Назови фильм или сериал для удаления.",
    "Какой тайтл удаляем?",
    "Что удалить? Кидай название!",
    "Назови, что убрать из списка.",
    "Какой фильм или сериал вычеркнуть?",
    "Давай, говори название для удаления!",
    "Что убираем из коллекции?",
    "Назови, что удалить, я готов!",
    "Какое название вычеркнуть?",
    "Что удаляем? Напомни название.",
    "Говори, что убрать!)",
    "Напиши, что удалить из списка.",
]

# = = = = = = = = = = = = /viewed = = = = = = = = = = = =

# Responses for /viewed like "Что посмотрели?"
VIEWED_RESPONSES = [
    "Что посмотрели?)",
    "Что добавить в список просмотренных? 📺",
    "Опять что-то посмотрели? 🎬",
    "Ну и что же вы посмотрели за последнее время? 🤔",
    "Ну, расскажите, что смотрели недавно? 👀",
    "Какой фильм или сериал вы недавно посмотрели? 🎥",
    "Что нового в вашем списке просмотренного? 🍿",
    "Смотрели что-то интересное на днях? 🎬",
    "Есть что посоветовать из недавнего? 🤩",
]

# /viewed NOT FOUND raise like"Не нашёл, а вы добавляли?"
NOT_FOUND_RESPONSES = [
    "Не нашёл, а вы точно добавляли? 😲",
    "Я не смог найти, может, вы не добавляли этот контент? 🤔",
    "Не нахожу, а был ли этот фильм у вас уже в списке? 🧐",
    "Не могу найти такой, если интересный, может добавишь заново? :D",
    "Что-то не получилось найти, вы его уже добавляли? 😕",
    "Такого не нашёл, может его скушоли? 🤨",
]

# /viewed recomendation question like "Ну и как вам, рекомендуете другим?"
RECOMMENDATION_RESPONSES = [
    "Рекомендуете другим посмотреть? 🤔",
    "Ну и как вам, рекомендуете другим?",
    "Порекомендуете этот фильм или сериал? 🤩",
    "Хотите порекомендовать друзьям? 😏",
    "Стоит ли порекомендовать это другим? 😎",
    "Как вам, рекомендуете к просмотру? 📣",
    "Рекомендуете посмотреть другим? 🤔",
    "Этот контент вас зацепил? Можете порекомендовать? 🤗",
    "Хотите, чтобы другие тоже посмотрели? 🌟",
    "Как вам, хотите порекомендовать этот фильм или сериал друзьям? 📽️",
    "Что скажете? Советуете посмотреть другим? 🎬",
    "Думаете, другим стоит посмотреть? 🤩",
    "Вы бы порекомендовали этот контент? 🤔",
    "В общем, вы бы посоветовали это другим людям? 👀",
    "Как вам контент, понравился ли он настолько, чтобы посоветовать? 🎥",
]
